src/cf/InformationRegisters/НастройкиОрганизацийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОрганизацийМЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВходящегоДокументаПоУмолчанию</Name>
					<Comment>Специфичен для конфигурации Документооборот, при внедрении в другую конфигурацию может быть не актуален</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидДокументаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифИнформацияОграниченногоРаспространения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифОбычнаяИнформация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОтправкиFTP</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПолучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПолученияFTP</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегШтампСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегШтампСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбмена</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраницаВставкиРегШтампа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтраницаВставкиКартинки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраницаВставкиШтампаЭП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтраницаВставкиКартинки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРазмерПорции</Name>
					<Comment>Удален в релизе 3.0.10</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтампСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтампСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыАвтосозданияУведомленийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыАвтосозданияУведомленийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСоздавать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создавать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздаватьИОтправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/МЭДОПовтИсп/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Автоматически отправлять квитанции МЭДО. Кэширование получения константы.
// 
// Возвращаемое значение:
//  Произвольный, Булево -  Автоматически отправлять квитанции МЭДО
Функция АвтоматическиОтправлятьКвитанцииМЭДО() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.АвтоматическиОтправлятьКвитанцииМЭДО.Получить();
	
КонецФункции

// Автоматически создавать/отправлять уведомления МЭДО. Кэширование получения константы.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыАвтосозданияУведомленийМЭДО -
Функция ВариантАвтосозданияУведомленийМЭДО() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВариантАвтосозданияУведомленийМЭДО.Получить();
	
КонецФункции

// Время хранения журнала событий. Кэширование получения константы.
// 
// Возвращаемое значение:
//  Число
Функция ВремяХраненияЖурналаСобытий() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВремяХраненияЖурналаСобытийМЭДО.Получить();
	
КонецФункции

// Функция - Получает настройки организации для МЭДО.
//
// Параметры:
//  Организация		- ОпределяемыйТип.Организация - Организация, для которой надо получить настройки.
//  СписокНастроек	- Строка,Неопределено - Список настроек через запятую, если не указан, то получить все настройки
// 
// Возвращаемое значение:
//  См. РегистрыСведений.НастройкиОрганизацийМЭДО.НовыйНастройки
Функция НастройкиОрганизации(Знач Организация, СписокНастроек = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = МЭДОПереопределяемый.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.НастройкиОрганизацийМЭДО КАК Настройки
		|ГДЕ
		|	Настройки.Организация = &Организация");
	Если ЗначениеЗаполнено(СписокНастроек) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", СписокНастроек);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат МЭДОСтруктурыДанных.РезультатЗапросаВСтруктуру(Запрос.Выполнить());
	
КонецФункции

// Нужно создавать автоматически создавать уведомления или нет. Кэширование значений константы
// 
// Возвращаемое значение:
//  Булево - Нужно или нет
Функция НужноСоздаватьУведомления() Экспорт
	
	Вариант = ВариантАвтосозданияУведомленийМЭДО();
	Возврат Вариант = Перечисления.ВариантыАвтосозданияУведомленийМЭДО.Создавать
		Или Вариант = Перечисления.ВариантыАвтосозданияУведомленийМЭДО.СоздаватьИОтправлять;
	
КонецФункции

// Размер порции обработки. Кэширование получения константы.
// 
// Возвращаемое значение:
//  Число - Размер порции обработки
Функция РазмерПорцииОбработки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РазмерПорции = Константы.РазмерПорцииОбработкиМЭДО.Получить();
	Если РазмерПорции = 0 Тогда
		РазмерПорции = 50; // по умолчанию.
	КонецЕсли;
	
	Возврат РазмерПорции;
	
КонецФункции

#КонецОбласти
